# H&M 고객 데이터 문제 세트 (Pandas)

In [1]:
# ✅ 기본 설정 (수정 금지)
import pandas as pd

df = pd.read_csv("customer_hm.csv")
print(df.shape)
df.head()

(1048575, 6)

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52

---

### 문제 1 — 그룹화: `club_member_status`별 고객 수 집계
• `club_member_status`별 행 개수를 구하세요. (힌트: `groupby`와 `.size()` 또는 `.count()`)  
• 결과는 Series 또는 DataFrame 형태여도 됩니다.

In [2]:
df1 = df

df1.groupby(by = 'club_member_status' ).size()

club_member_status
ACTIVE        982635
LEFT CLUB        359
PRE-CREATE     65581
dtype: int64

---

### 문제 2 — 그룹화: `fashion_news_frequency`별 평균 나이
• `fashion_news_frequency` 그룹별 `age`의 평균을 구하세요. (`groupby` + `.mean()`)

In [3]:
df2 = df

df2.groupby(by = 'fashion_news_frequency')['age'].mean().astype(int)

fashion_news_frequency
Monthly      39
NONE         36
Regularly    37
Name: age, dtype: int64

---

### 문제 3 — 그룹화: `club_member_status`와 `Active` 복합 그룹의 `FN` 평균(=구독률)
• `['club_member_status', 'Active']`로 그룹화하여 `FN`의 평균을 구하세요. (0/1 평균은 비율로 해석 가능)

In [4]:
df3 = df

FN_AVG = df3.groupby(by = ['club_member_status', 'Active'])['FN'].value_counts(normalize=True).round(4)*100

pd.DataFrame(FN_AVG)

                              proportion
club_member_status Active FN
ACTIVE             0      0        98.44
                          1         1.56
                   1      1       100.00
LEFT CLUB          0      0        99.72
                          1         0.28
                   1      1       100.00
PRE-CREATE         0      0        99.82
                          1         0.18
                   1      1       100.00

---

### 문제 4 — 문자열: `customer_id` 길이 계산
• `customer_id`의 문자 길이를 계산한 `id_len` 열을 추가하세요. (`.str.len()`)  
• 추가로, `id_len`의 최솟값/최댓값을 출력하세요.

In [5]:
df4 = df.copy(deep=True)

df4['id_len'] = df4['customer_id'].str.len()

df4.head()

id_max_len = df4['id_len'].max()
id_min_len = df4['id_len'].min()

print(f'ID 최대 길이 :  {id_max_len}')
print(f'ID 최소 길이 :  {id_min_len}')
df4.head()

ID 최대 길이 :  64
ID 최소 길이 :  64

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age,id_len
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49,64
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25,64
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24,64
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54,64
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52,64

---

### 문제 5 — 문자열: 아이디 접두(prefix) 추출 및 빈도
• `customer_id`의 앞 8글자를 추출하여 `id_prefix` 열로 저장하세요. (`.str[:8]`)  
• `id_prefix`의 상위 10개 빈도를 구하세요. (`value_counts().head(10)`)

In [6]:
df5 = df

id_prefix = df5['customer_id'].str[:8]

id_prefix.value_counts().head(10).reset_index()

  customer_id  count
0    3f758c81      2
1    2d18a1d0      2
2    3c3a079f      2
3    1dc7fc43      2
4    12531b59      2
5    466b56ef      2
6    148824c7      2
7    254411b4      2
8    0264a00f      2
9    5796cdcc      2

---

### 문제 6 — 문자열: `fashion_news_frequency` 소문자화
• `fashion_news_frequency` 값을 모두 소문자로 변환하여 `fn_lower` 열에 저장하세요. (`.str.lower()`)  
• 변환 후 고유값을 출력하세요. (`.unique()`)

In [7]:
df6 = df

fn_lower = df6['fashion_news_frequency'].str.lower()

print(fn_lower.unique())

['none' 'regularly' 'monthly' nan]

---

### 문제 7 — map: `club_member_status`를 한글 라벨로 매핑
• 매핑 사전 예시: `{{'ACTIVE': '활동', 'PRE-CREATE': '사전생성', 'LEFT': '탈퇴'}}`  
• `status_ko` 열로 저장하고, 각 라벨별 개수를 구하세요. (`.map` + `value_counts()`)

In [8]:
df7 = df

#df7['club_member_status'].value_counts()

map_list = {'ACTIVE': '활동', 'PRE-CREATE': '사전생성', 'LEFT CLUB': '탈퇴'}

status_ko = df7['club_member_status'].map(map_list)

status_ko.value_counts().reset_index()

  club_member_status   count
0                 활동  982635
1               사전생성   65581
2                 탈퇴     359

---

### 문제 8 — apply/lambda: 나이대 구간화
• `age`를 기준으로 `age_group`을 생성하세요. 규칙 예시: `<20: '10대', 20~39: '20-30대', 40~59: '40-50대', 60+: '60대+'`.  
• 각 나이대별 고객 수를 구하세요.

In [9]:
df8 = df

age_list = df8['age']

age_gr = {
    range(0,20) : "10대",
    range(20,30) : "20대",
    range(30,40) : "30대",
    range(40,50) : "40대",
    range(50,60) : "50대",
    range(60,200) : "60대+"
}

age_group = age_list.apply(
    lambda x : next(group for age,group in age_gr.items() if x in age),'0')

print(age_group.value_counts().sort_index())

C:\Users\njh94\AppData\Local\Temp\ipykernel_14788\917925444.py:14: FutureWarning: the convert_dtype parameter is deprecated and will be removed in a future version.  Do ``ser.astype(object).apply()`` instead if you want ``convert_dtype=False``.
  age_group = age_list.apply(

age
10대      55256
20대     409196
30대     181112
40대     157445
50대     174715
60대+     70851
Name: count, dtype: int64

---

### 문제 9 — 시간: 출생연도(근사) → datetime 변환
• `approx_birth_year = 2024 - age` 로 계산 후, 문자열 `'YYYY-01-01'`을 만들어 `pd.to_datetime`으로 변환하여 `birthdate` 열을 만드세요.  
• `birthdate.dt.year`를 확인하고, 출생연도(근사)별 고객 수를 집계하세요.

In [10]:
df9 = df

approx_birth_year = 2024 - df9['age']

approx_birth_year = approx_birth_year.astype(str) + '-01-01'

birthdate = pd.to_datetime(approx_birth_year, format='%Y-%m-%d')

birthdate.dt.year.value_counts().sort_index().reset_index()

     age  count
0   1925     11
1   1926      5
2   1927      4
3   1928      2
4   1929      4
..   ...    ...
79  2004  42891
80  2005  29206
81  2006  18606
82  2007   7329
83  2008    115

[84 rows x 2 columns]

---

### 문제 10 — 시간: 멤버십 가입일 가정 → 재직일수(근사)
• 상태별 가상의 가입일 매핑을 만드세요. 예시: `ACTIVE → '2020-01-01'`, `PRE-CREATE → '2024-01-01'`, `LEFT → '2019-01-01'`.  
• 이를 `member_since` 문자열 열로 만든 뒤 `pd.to_datetime`으로 변환하고, 기준일 `'2024-12-31'`와의 일수 차(`tenure_days`)를 계산하세요. (`.dt`/timedelta)

In [11]:
df10 = df
from datetime import datetime, timedelta

membership_date = {
    'ACTIVE' : '2020-01-01',
    'PRE-CREATE' : '2024-01-01',
    'ACTIVE' : '2019-01-01'
    }

member_since = df10['club_member_status'].map(membership_date)

member_since = pd.to_datetime(member_since)

tenure_days = pd.to_datetime('2024-12-31') - member_since

tenure_days

0         2191 days
1         2191 days
2         2191 days
3         2191 days
4         2191 days
             ...
1048570   2191 days
1048571   2191 days
1048572   2191 days
1048573   2191 days
1048574   2191 days
Name: club_member_status, Length: 1048575, dtype: timedelta64[ns]

---

### 문제 11 — Merge: 뉴스 구독 빈도 매핑 병합
• 다음과 같은 매핑 DataFrame을 생성하세요: 
  `map_df = pd.DataFrame({{'fashion_news_frequency': ['NONE','Monthly','Regularly'], 'fn_rank': [0,1,2]}})`  
• `df`와 `map_df`를 `fashion_news_frequency` 기준으로 **left merge**하여 `fn_rank` 열을 추가하세요.

In [ ]:
df11 = df
df11 = df11.dropna(subset ='fashion_news_frequency', inplace=False)

map_df = pd.DataFrame({
        'fashion_news_frequency': ['NONE','Monthly','Regularly'], 
        'fn_rank' : [0,1,2]
        })

df11 = pd.merge(df11, map_df, how = 'left', on= 'fashion_news_frequency')

df11

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age,fn_rank
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49,0
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25,0
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24,0
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54,0
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52,2
...,...,...,...,...,...,...,...
1048569,c88f5971612e659a4e90d6f08d9c29bdf1e4268fcf52d5...,1,1,ACTIVE,Regularly,22,2
1048570,c88f5d0deba322a686e7928da6a7f3d2318e102d1c2cdb...,1,1,ACTIVE,Regularly,41,2
1048571,c88f99a55b10f6dd50dd87c3ca05af4a8a6c98f3e6fbc5...,0,0,ACTIVE,NONE,38,0
1048572,c88fa15c06519c4bdcab386fea313b226113584b729874...,1,1,ACTIVE,Regularly,54,2
1048573,c88fa6553539a079a4d49f5b6d286d33bdc7117d0acbb9...,0,0,ACTIVE,NONE,49,0

---

### 문제 12 — Concat: 짝수/홀수 인덱스 분할 후 복원
• 짝수 인덱스만 담은 `df_even`, 홀수 인덱스만 담은 `df_odd`를 만든 뒤 `pd.concat([df_even, df_odd], axis=0)`으로 다시 합치세요.  
• 원본 행 수와 동일한지 확인하세요.

In [36]:
df12 = df

print(f'원본 쉐이프 : {df12.shape}\n')

df_odd  = df12.loc[ : :2]
df_even = df12.loc[1: :2]

print(f'홀수 쉐이프 : {df_odd.shape}')
print(f'짝수 쉐이프 : {df_even.shape}\n')


df_concat = pd.concat([df_odd,df_even], axis=0)

print(f'결합 쉐이프 : {df_concat.shape}')

원본 쉐이프 : (1048575, 6)

홀수 쉐이프 : (524288, 6)
짝수 쉐이프 : (524287, 6)

결합 쉐이프 : (1048575, 6)